Revit 2027 API
AssetProperties.FindByName Method
 Gets the property with the given name.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AssetProperty FindByName(
	string name
)
Public Function FindByName (
	name As String
) As AssetProperty
public:
AssetProperty^ FindByName(
	String^ name
)
member FindByName :
        name : string -> AssetProperty
Parameters
name String
 Name of the property.
Return Value
AssetProperty
 The property with the specified name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 FindByName will not visit the properties of any connected asset on any of the properties.
See Also
Reference
AssetProperties Class
Autodesk.Revit.DB.Visual Namespace